mainModule.controller('homeController', ['$scope', '$state', '$compile', function ($scope, $state, $compile) {
    var vm = this;
    vm.promp = false;
    vm.data = {
        title: '权限分组表',
        thead: ['编号', '分组名称', '分组描述', '用户列表', '操作'],
        tbody: [
            ['1', '管理员', '管理员', '切克闹'],
            ['2', '管理员', '管理员', '切克闹'],
            ['3', '管理员', '管理员', '切克闹'],
            ['4', '管理员', '管理员', '切克闹'],
            ['5', '管理员', '管理员', '切克闹']
    //'1111', '22222', '333333', '4444'
           ],
        control: true
    };
    vm.users = {
        title: '用户列表',
        thead: ['ID', '姓名', '用户名', '邮箱', '电话', '访问次数', '操作'],
        tbody: [
            ['001', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['002', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['003', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['004', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['005', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['006', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['007', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11']
        ],
        control: true
    };
    vm.teams = {
        title: '团队列表',
        thead: ['团队名称', '团队简介', '建立时间','项目经理', '团队成员', '团队权限', '操作'],
        tbody: [
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333']
        ],
        control: true
    };

    vm.department = {
      title: '部门列表',
        thead: ['部门名称', '部门描述', '部门经理', '部门成员', '部门权限', '操作'],
        tbody: [
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111']
        ],
        control: true
    };

    vm.tasks = {
        title: '任务列表',
        thead: ['任务编号', '任务名称', '任务描述', '重要系数','任务人员', '任务状态', '截止日期', '操作'],
        tbody: [
            ['001', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30'],
            ['002', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30'],
            ['003', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30'],
            ['004', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30'],
            ['005', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30'],
            ['006', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30']

        ],
        control: true
    };

    vm.dailypapers = {
        title: '日报列表',
        thead: ['日期', '任务', '完成度', '备注', '操作'],
        tbody: [
            ['2016-06-30', 'sbt', '50%', '', '查看'],
            ['2016-06-29', 'sbt', '50%', '', '查看'],
            ['2016-06-28', 'sbt', '50%', '', '查看'],
            ['2016-06-27', 'sbt', '50%', '', '查看'],
            ['2016-06-26', 'sbt', '50%', '', '查看'],
            ['2016-06-25', 'sbt', '50%', '', '查看']
        ]
    };

    vm.userform = {
      form1 : {
          label: '用户名',
          type: 'text'
      },
        form2 : {
            label: '姓名',
            type: 'text'
        },
        form3 : {
            label: '邮箱',
            type: 'text'
        },
        form4 : {
            label: '电话',
            type: 'text'
        },
        form5 : {
            label: '职位',
            type: 'text'
        }
    };
    vm.teamform = {
        form1 : {
            label: '团队名称',
            type: 'text'
        },
        form2 : {
            label: '团队描述',
            type: 'text'
        }
    };
    vm.departmentform = {
        form1 : {
            label: '部门名称',
            type: 'text'
        },
        form2 : {
            label: '部门描述',
            type: 'text'
        }
    };
    $('#side-menu').metisMenu();

    vm.changePassword = function () {
        var html = '<div class="form-group col-lg-10 col-lg-offset-1"><label>新密码</label><input class="form-control"> </div><div class="form-group col-lg-10 col-lg-offset-1"><label>再次输入</label><input class="form-control"></div>';
        vm.promp = true;
        $('#clude').html($compile(html));

    };
    vm.closePromp = function () {
        vm.promp = false;
    }

}]);