mainModule.controller('homeController', ['$scope', '$state', '$compile', 'mainService', '$rootScope', 'treeService', function ($scope, $state, $compile, mainService, $rootScope, treeService) {
    var vm = this;
    //$rootScope.promp = false;
    vm.mainService = mainService;


    vm.users = {
        title: '用户列表',
        thead: ['ID', '姓名', '用户名', '邮箱', '电话', '访问次数', '操作'],
        tbody: [
            ['001', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['002', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['003', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['004', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['005', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['006', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11'],
            ['007', '程大陆', '小胖', 'xiaopang@qq.com', '13513513511', '11']
        ],
        control: true
    };
    vm.teams = {
        title: '团队列表',
        thead: ['团队名称', '团队简介', '建立时间','项目经理', '团队成员', '团队权限', '操作'],
        tbody: [
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333'],
            ['SBT', 'sbt项目', '2015-06-06', '娘娘', '亮亮, 露露', '333']
        ],
        control: true
    };

    vm.department = {
      title: '部门列表',
        thead: ['部门名称', '部门描述', '部门经理', '部门成员', '部门权限', '操作'],
        tbody: [
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111'],
            ['制作部', '课件制作', '隔壁老王', '张三，李四，王二麻子', '111']
        ],
        control: true
    };

    vm.tasks = {
        title: '任务列表',
        thead: ['任务编号', '任务名称', '任务描述', '重要系数','任务人员', '任务状态', '截止日期', '操作'],
        tbody: [
            ['001', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30'],
            ['002', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30'],
            ['003', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30'],
            ['004', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30'],
            ['005', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30'],
            ['006', 'sbt', '威朗项目', '3', '谢国亮,杨勇', '未完成', '2016-06-30']

        ],
        control: true
    };

    vm.dailypapers = {
        title: '日报列表',
        thead: ['日期', '任务', '完成度', '备注', '操作'],
        tbody: [
            ['2016-06-30', 'sbt', '50%', '', '查看'],
            ['2016-06-29', 'sbt', '50%', '', '查看'],
            ['2016-06-28', 'sbt', '50%', '', '查看'],
            ['2016-06-27', 'sbt', '50%', '', '查看'],
            ['2016-06-26', 'sbt', '50%', '', '查看'],
            ['2016-06-25', 'sbt', '50%', '', '查看']
        ]
    };


    vm.teamform = {
        form1 : {
            label: '团队名称',
            type: 'text'
        },
        form2 : {
            label: '团队描述',
            type: 'text'
        }
    };
    vm.departmentform = {
        form1 : {
            label: '部门名称',
            type: 'text'
        },
        form2 : {
            label: '部门描述',
            type: 'text'
        }
    };

    vm.usertasks = {
        title: '我的任务',
        thead: ['任务编号', '任务名称', '任务描述', '重要系数', '任务状态', '截止日期', '操作'],
        tbody: [
            ['001', 'sbt', '威朗项目', '3', '未完成', '2016-06-30', '查看'],
            ['002', 'sbt', '威朗项目', '3', '未完成', '2016-06-30', '查看'],
            ['003', 'sbt', '威朗项目', '3', '未完成', '2016-06-30', '查看'],
            ['004', 'sbt', '威朗项目', '3', '未完成', '2016-06-30', '查看'],
            ['005', 'sbt', '威朗项目', '3', '未完成', '2016-06-30', '查看'],
            ['006', 'sbt', '威朗项目', '3', '未完成', '2016-06-30', '查看']

        ],
        control: false,
        page: false
    };

    vm.usereport = {
        title: '我的日报',
        thead: ['日期', '任务', '完成度', '备注', '操作'],
        tbody: [
            ['2016-06-30', 'sbt', '50%', '', '查看'],
            ['2016-06-29', 'sbt', '50%', '', '查看'],
            ['2016-06-28', 'sbt', '50%', '', '查看'],
            ['2016-06-27', 'sbt', '50%', '', '查看'],
            ['2016-06-26', 'sbt', '50%', '', '查看'],
            ['2016-06-25', 'sbt', '50%', '', '查看']
        ],
        control: false
    };

    vm.dynamic = {
        title: '最新动态',
        thead: ['日期', '事件'],
        tbody: [
            ['2016-06-30 11：24', 'xxx发布了任务'],
            ['2016-06-29 11：24', 'xxx发送了周报'],
            ['2016-06-28 11：24', 'xxx发送了周报'],
            ['2016-06-27 11：24', 'xxx发送了周报'],
            ['2016-06-26 11：24', 'xxx发送了周报'],
            ['2016-06-25 11：24', 'xxx发送了周报'],
            ['2016-06-29 11：24', 'xxx发送了周报'],
            ['2016-06-28 11：24', 'xxx发送了周报'],
            ['2016-06-27 11：24', 'xxx发送了周报'],
            ['2016-06-26 11：24', 'xxx发送了周报'],
            ['2016-06-25 11：24', 'xxx发送了周报']
        ],
        control: false
    };
    vm.personal = {
        title: '我的档案',
        thead: [],
        tbody: [
            ['用户名', 'zhouboyu'],
            ['真实姓名', '周博宇'],
            ['所属部门', '平台部'],
            ['职位', '前端开发'],
            ['权限', '研发'],
            ['邮箱', 'zby@xcj.com'],
            ['加入日期', '016-06-28'],
            ['最后登陆', '016-06-28'],
            ['访问次数', '1']
        ],
        control: false
    };

    $('#side-menu').metisMenu();

    vm.changePassword = function () {
        var html = '<div class="form-group col-lg-10 col-lg-offset-1"><label>新密码</label><input class="form-control"> </div><div class="form-group col-lg-10 col-lg-offset-1"><label>再次输入</label><input class="form-control"></div>';
        vm.mainService.promp = true;
        $('#clude').html($compile(html)($scope));

    };


}]);